tests/assets/test_suites/w3c_wsdl20/messages/good/InOut-3G/canon-inout-selftest.descmsg

<?xml version="1.0" encoding="UTF-8"?>
<!-- https://dev.w3.org/2002/ws/desc/test-suite/messages/good/InOut-3G/canon-inout-selftest.descmsg -->
<!-- Copyright © 2008 - W3C, (MIT, ERCIM, Keio). All Rights Reserved. http://www.w3.org/Consortium/Legal/2002/copyright-documents-20021231 -->
<log xmlns="http://www.w3.org/2002/ws/desc/logs/">
<message timestamp="2006-07-06T14:12:28.787Z" conversation="1" number="1" type="request">
<senderHostAndPort>KERGUELEN:1594</senderHostAndPort>
<receiverHostAndPort>youenn.dyndns.ws:80</receiverHostAndPort>
<httpHeaders>
<Method value="POST">
<uri>/wss/echo</uri>
</Method>
<Host>youenn.dyndns.ws</Host>
<Pragma>no-cache</Pragma>
<Accept>*/*</Accept>
<Content-Type type="application/soap+xml">application/soap+xml;action=""</Content-Type>
<Content-Length>301</Content-Length>

</httpHeaders>
<content><?_xml version="1.0"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"><env:Body><ns1:echoXML xmlns:ns1="http://www.wso2.com/schemas/2006/interop/EchoService"><echoXMLParam><ns2:testName xmlns:ns2="testNs">testValue</ns2:testName></echoXMLParam></ns1:echoXML></env:Body></env:Envelope></content>
</message>
<message timestamp="2006-07-06T14:12:29.057Z" conversation="1" number="2" type="response">
<senderHostAndPort>youenn.dyndns.ws:80</senderHostAndPort>
<receiverHostAndPort>KERGUELEN:1594</receiverHostAndPort>
<httpHeaders>
<StatusCode value="200">HTTP/1.1 200 OK</StatusCode>
<Date>Thu, 06 Jul 2006 18:12:26 GMT</Date>
<Server>Apache/2.0.50 (Win32)</Server>
<Content-Length>288</Content-Length>
<Content-Type type="application/soap+xml">application/soap+xml</Content-Type>

</httpHeaders>
<content><?_xml version="1.0"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"><env:Body><ns1:echoXMLResponse xmlns:ns1="http://www.wso2.com/schemas/2006/interop/EchoService"><ns2:testName xmlns:ns2="testNs">testValue</ns2:testName></ns1:echoXMLResponse></env:Body></env:Envelope></content>
</message>
</log>
